module tridiagonal
implicit none
contains

function tridiag (A, B) result (C)
implicit none

    real, dimension (1:,1:) :: A, B
    real, dimension (1:5,size(A(1,:))) :: C

    integer n, i, j, k

    n = size (A(1,:))

    !Первые две и две последние строки в произведении отличаются от остальных строк количеством ненулевых элементов.
    !можно посчитать отдельно три блока: первые две, последние две и строки со второй до n-3 
    C(1,1) = 0                                   
    C(2,1) = 0
    C(3,1) = A(2, 1)*B(2, 1) + A(3, 1)*B(1, 2) 
    C(4,1) = A(2, 1)*B(3, 1) + A(3, 1)*B(2, 2)
    C(5,1) = A(3, 1)*B(3, 2)

    C(1,2) = 0                                      
    C(2,2) = A(1, 2)*B(2, 1) + A(2, 2)*B(1, 2)
    C(3,2) = A(1, 2)*B(3, 1) + A(2, 2)*B(2, 2) + A(3, 2)*B(1, 3) 
    C(4,2) = A(2, 2)*B(3, 2) + A(3, 2)*B(2, 3)
    C(5,2) = A(3, 2)*B(3, 3)

    do i = 2, n - 3   
                       !строчки с 3 до n-2 (из за того, что матрицы А и B вида (n x 3), делаем "почти" умножение матриц, но только 
        k = i + 1                !со смещенными коэффциентами на 1 и на 2
        j = i + 2

        C(1,k) = A(1, k)*B(1, i)
        C(2,k) = A(1, k)*B(2, i) + A(2, k)*B(1, k)
        C(3,k) = A(1, k)*B(3, i) + A(2, k)*B(2, k) + A(3, k)*B(1, j) 
        C(4,k) = A(2, k)*B(3, k) + A(3, k)*B(2, j)
        C(5,k) = A(3, k)*B(3, j)
    
    enddo

    i = n - 2
    k = n - 1 
    j = n                 

    C(1,k) = A(1, k)*B(1, i)                        
    C(2,k) = A(1, k)*B(2, i) + A(2, k)*B(1, k)
    C(3,k) = A(1, k)*B(3, i) + A(2, k)*B(2, k) + A(3, k)*B(1, j) 
    C(4,k) = A(2, k)*B(3, k) + A(3, k)*B(2, j)
    C(5,k) = 0

    C(1,j) = A(1, k)*B(1, i)                        
    C(2,j) = A(1, k)*B(2, i) + A(2, k)*B(1, k)
    C(3,j) = A(1, k)*B(3, i) + A(2, k)*B(2, k) + A(3, k)*B(1, j) 
    C(4,j) = A(2, k)*B(3, k) + A(3, k)*B(2, j)
    C(5,j) = 0

end function tridiag
end module tridiagonal
